Revit 2026 API

# FaceArea Property

---

The area of this face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Area { get; }
```
```vb
Public ReadOnly Property Area As Double
	Get
```
```cpp
public:
property double Area {
	double get ();
}
```
```fsharp
member Area : float with get
```

#### Property Value

Double

Returns zero if fails to compute the area. In some cases, this area may be estimated.

#### Reference

Face Class

Autodesk.Revit.DB Namespace